%%--------------------------------------------------------------------
%% Конфигурация пользователя
%%--------------------------------------------------------------------

-define(DEBUG_MODE, true). % Используются отладочные команды

%%--------------------------------------------------------------------
%% Модель пользователя
%%--------------------------------------------------------------------
-record(client, {
    listen_socket,
    socket     = false,
    raw_data   = <<>>    :: binary()
}).
