%%--------------------------------------------------------------------
%% Супервизор подключения по сокету
%%--------------------------------------------------------------------
-module(client_sup).
-behaviour(supervisor).

-export([start_link/1, start_child/0]).
-export([init/1]).

-define(SERVER, ?MODULE).

%%--------------------------------------------------------------------
%% Создание экземпляра процесса
%%--------------------------------------------------------------------
start_link(ListenSocket) ->
    supervisor:start_link({local, ?SERVER}, ?MODULE, ListenSocket).

%%--------------------------------------------------------------------
%% Создание экземпляра пользователя
%%--------------------------------------------------------------------
start_child() ->
    supervisor:start_child(?SERVER, []).

%%--------------------------------------------------------------------
%% Инициализация супервизора
%%--------------------------------------------------------------------
init(ListenSocket) ->
    {ok, {{simple_one_for_one, 0, 1}, [{client, {client, start_link, [ListenSocket]}, temporary, brutal_kill, worker, [client]}]}}.
